# PipingPressure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..PipingPressure Property
SpecTypeId Class See Also
---
Pressure, in discipline Piping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PipingPressure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipingPressure As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PipingPressure {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace